src/main/resources/request/Retry.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mes="http://schemas.consiliumtechnologies.com/services/mobile/2009/03/messaging">
    <soapenv:Header/>
    <soapenv:Body>
        <mes:RetryMessageRequest>
            <mes:Id>?</mes:Id>
        </mes:RetryMessageRequest>
    </soapenv:Body>
</soapenv:Envelope>